Merge branch 'main' into fix/5830
